plot/stage2/iwlc_compose2.txt
[root@fa21-cs523-17 wrk2]# ./wrk -D exp -t 1 -c 100 -d 20 -L -s ./scripts/media-microservices/compose-review.lua http://localhost:8080/wrk2-api/review/compose -R 800
Running 20s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread calibration: mean lat.: 13.848ms, rate sampling interval: 44ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.34ms    6.79ms  37.63ms   75.37%
    Req/Sec   802.00    130.55     1.14k    73.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.81ms
 75.000%   16.40ms
 90.000%   21.95ms
 99.000%   37.63ms
 99.900%   49.57ms
 99.990%   58.65ms
 99.999%   65.92ms
100.000%   65.92ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.235     0.000000            1         1.00
       6.387     0.100000          788         1.11
       7.903     0.200000         1569         1.25
       9.175     0.300000         2356         1.43
      10.455     0.400000         3139         1.67
      11.807     0.500000         3926         2.00
      12.591     0.550000         4316         2.22
      13.383     0.600000         4708         2.50
      14.255     0.650000         5105         2.86
      15.247     0.700000         5495         3.33
      16.399     0.750000         5887         4.00
      17.023     0.775000         6083         4.44
      17.839     0.800000         6278         5.00
      18.687     0.825000         6479         5.71
      19.583     0.850000         6671         6.67
      20.591     0.875000         6866         8.00
      21.199     0.887500         6963         8.89
      21.951     0.900000         7061        10.00
      22.767     0.912500         7161        11.43
      23.935     0.925000         7257        13.33
      25.119     0.937500         7355        16.00
      25.775     0.943750         7404        17.78
      26.639     0.950000         7453        20.00
      27.327     0.956250         7503        22.86
      28.655     0.962500         7551        26.67
      29.455     0.968750         7601        32.00
      30.095     0.971875         7626        35.56
      30.815     0.975000         7650        40.00
      31.631     0.978125         7674        45.71
      32.479     0.981250         7698        53.33
      33.631     0.984375         7723        64.00
      34.399     0.985938         7736        71.11
      35.743     0.987500         7747        80.00
      37.183     0.989062         7760        91.43
      37.983     0.990625         7773       106.67
      38.591     0.992188         7785       128.00
      39.039     0.992969         7790       142.22
      39.551     0.993750         7796       160.00
      40.671     0.994531         7803       182.86
      41.183     0.995313         7809       213.33
      42.335     0.996094         7815       256.00
      42.943     0.996484         7818       284.44
      43.071     0.996875         7821       320.00
      43.583     0.997266         7824       365.71
      44.511     0.997656         7827       426.67
      45.599     0.998047         7830       512.00
      46.111     0.998242         7832       568.89
      46.687     0.998437         7833       640.00
      48.127     0.998633         7835       731.43
      49.471     0.998828         7836       853.33
      50.079     0.999023         7838      1024.00
      50.303     0.999121         7839      1137.78
      50.303     0.999219         7839      1280.00
      50.815     0.999316         7840      1462.86
      50.943     0.999414         7841      1706.67
      53.247     0.999512         7842      2048.00
      53.247     0.999561         7842      2275.56
      53.247     0.999609         7842      2560.00
      58.367     0.999658         7843      2925.71
      58.367     0.999707         7843      3413.33
      58.655     0.999756         7844      4096.00
      58.655     0.999780         7844      4551.11
      58.655     0.999805         7844      5120.00
      58.655     0.999829         7844      5851.43
      58.655     0.999854         7844      6826.67
      65.919     0.999878         7845      8192.00
      65.919     1.000000         7845          inf
#[Mean    =       13.340, StdDeviation   =        6.792]
#[Max     =       65.856, Total count    =         7845]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15864 requests in 20.00s, 5.48MB read
  Non-2xx or 3xx responses: 15864
Requests/sec:    793.22
Transfer/sec:    280.42KB



[root@fa21-cs523-17 wrk2]# ./wrk -D exp -t 1 -c 100 -d 20 -L -s ./scripts/media-microservices/compose-review.lua http://localhost:8080/wrk2-api/review/compose -R 800
Running 20s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread calibration: mean lat.: 15.854ms, rate sampling interval: 55ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.27ms    7.93ms  41.28ms   78.18%
    Req/Sec   800.30    124.81     1.07k    65.36%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.11ms
 75.000%   17.61ms
 90.000%   24.75ms
 99.000%   41.28ms
 99.900%   64.22ms
 99.990%   74.62ms
 99.999%   75.07ms
100.000%   75.07ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.549     0.000000            1         1.00
       6.687     0.100000          786         1.11
       8.199     0.200000         1571         1.25
       9.471     0.300000         2356         1.43
      10.759     0.400000         3141         1.67
      12.111     0.500000         3927         2.00
      12.919     0.550000         4318         2.22
      13.919     0.600000         4712         2.50
      15.031     0.650000         5103         2.86
      16.207     0.700000         5498         3.33
      17.615     0.750000         5888         4.00
      18.367     0.775000         6087         4.44
      19.247     0.800000         6280         5.00
      20.287     0.825000         6477         5.71
      21.599     0.850000         6675         6.67
      22.959     0.875000         6869         8.00
      23.775     0.887500         6968         8.89
      24.751     0.900000         7065        10.00
      25.711     0.912500         7164        11.43
      26.799     0.925000         7264        13.33
      28.031     0.937500         7361        16.00
      28.623     0.943750         7409        17.78
      29.455     0.950000         7458        20.00
      30.255     0.956250         7508        22.86
      31.103     0.962500         7556        26.67
      32.079     0.968750         7605        32.00
      32.767     0.971875         7630        35.56
      33.567     0.975000         7655        40.00
      34.591     0.978125         7679        45.71
      36.383     0.981250         7703        53.33
      37.791     0.984375         7728        64.00
      38.751     0.985938         7740        71.11
      39.711     0.987500         7752        80.00
      40.703     0.989062         7765        91.43
      42.047     0.990625         7777       106.67
      43.807     0.992188         7789       128.00
      45.183     0.992969         7795       142.22
      48.031     0.993750         7801       160.00
      48.863     0.994531         7808       182.86
      50.463     0.995313         7814       213.33
      52.127     0.996094         7820       256.00
      52.639     0.996484         7823       284.44
      54.303     0.996875         7826       320.00
      55.551     0.997266         7829       365.71
      57.183     0.997656         7832       426.67
      59.039     0.998047         7835       512.00
      59.999     0.998242         7837       568.89
      60.767     0.998437         7838       640.00
      62.943     0.998633         7840       731.43
      63.007     0.998828         7841       853.33
      65.407     0.999023         7843      1024.00
      65.727     0.999121         7844      1137.78
      65.727     0.999219         7844      1280.00
      66.175     0.999316         7846      1462.86
      66.175     0.999414         7846      1706.67
      66.815     0.999512         7847      2048.00
      66.815     0.999561         7847      2275.56
      66.815     0.999609         7847      2560.00
      72.703     0.999658         7848      2925.71
      72.703     0.999707         7848      3413.33
      74.623     0.999756         7849      4096.00
      74.623     0.999780         7849      4551.11
      74.623     0.999805         7849      5120.00
      74.623     0.999829         7849      5851.43
      74.623     0.999854         7849      6826.67
      75.071     0.999878         7850      8192.00
      75.071     1.000000         7850          inf
#[Mean    =       14.267, StdDeviation   =        7.927]
#[Max     =       75.008, Total count    =         7850]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  15866 requests in 20.00s, 5.48MB read
  Non-2xx or 3xx responses: 15866
Requests/sec:    793.24
Transfer/sec:    280.42KB